Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionFormatAttributes Class
 The DimensionFormatAttributes class controls the precision, format and unit of the dimension.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionFormatAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class DimensionFormatAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class DimensionFormatAttributes
	Inherits GenericAttributesBase
The DimensionSetBaseAttributes.DimensionFormatAttributes type exposes the following members.
Constructors
Name | Description
DimensionSetBaseAttributes.DimensionFormatAttributes()
 Creates a new dimension format attributes instance. By default the format rounds the dimension value to the nearest whole and shows it with no decimals. The unit is selected automatically.
DimensionSetBaseAttributes.DimensionFormatAttributes(DimensionSetBaseAttributes.DimensionValuePrecisions, DimensionSetBaseAttributes.DimensionValueFormats, DimensionSetBaseAttributes.DimensionValueUnits)
 Creates a new dimension format attributes instance with the given parameters.
Top
Properties
Name | Description
Format
 The format of the dimension.
Precision
 The precision of the dimension.
Unit
 Gets or sets the unit of the dimension. Changing this attribute does not have any effect if the dimension measures an angle.
UseDigitGrouping
 Gets or sets a value indicating whether digit grouping should be used or not.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace